// Задание 1
// Создать переменные num1, num2 которые пользователь вводит с клавиатуры
// Проверьте, что переменная num1 равна или меньше 1, а переменная num2 больше или равна 3.

// let  num1 = Number(prompt('Введите число'));
// let  num2 = Number(prompt('Введите число'));

// console.log((num1 <= 1) ? true : false);
// console.log((num2 >= 3) ? true : false);


// Задание 2
// Перепишите код к тернарному оператору

// let test = true;
// if (test === true) {
// console.log('+++');
// } else {
// console.log('---');
// }

// let test = true;
// console.log((test === true) ? '+++' : '---');


// Задание 3
// В переменной day лежит какое-то число из интервала от 1 до 31. 
// Определите в какую декаду месяца попадает это число (в первую, вторую или третью).

// let day = 1 + Math.floor(31*Math.random());


// if (day > 0 && day <= 10){
//     console.log(`Число ${day} попадает в первую декаду месяца`);
// } else if (day >= 11 && day <= 20){
//     console.log(`Число ${day} попадает во вторую декаду месяца`);
// } else{
//     console.log(`Число ${day} попадает в третью декаду месяца`);
// }
